backend/tests/LoadTests/results/analytics-load-20260502-224409.txt

          /\      |ΓÇ╛ΓÇ╛| /ΓÇ╛ΓÇ╛/   /ΓÇ╛ΓÇ╛/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ΓÇ╛ΓÇ╛\  
   /          \   |  |\  \ |  (ΓÇ╛)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: .\analytics-advanced-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 25s max duration (incl. graceful stop):
              * smoke: 5 looping VUs for 20s (exec: smokeSuite, gracefulStop: 5s)


running (01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
smoke   [   5% ] 5 VUs  01.0s/20s

running (02.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
smoke   [  10% ] 5 VUs  02.0s/20s

running (03.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
smoke   [  15% ] 5 VUs  03.0s/20s

running (04.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
smoke   [  20% ] 5 VUs  04.0s/20s

running (05.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  25% ] 5 VUs  05.0s/20s

running (06.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  30% ] 5 VUs  06.0s/20s

running (07.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  35% ] 5 VUs  07.0s/20s

running (08.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  40% ] 5 VUs  08.0s/20s

running (09.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  45% ] 5 VUs  09.0s/20s

running (10.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  50% ] 5 VUs  10.0s/20s

running (11.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  55% ] 5 VUs  11.0s/20s

running (12.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  60% ] 5 VUs  12.0s/20s

running (13.2s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  66% ] 5 VUs  13.2s/20s

running (14.1s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  70% ] 5 VUs  14.1s/20s

running (15.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  75% ] 5 VUs  15.0s/20s

running (16.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
smoke   [  80% ] 5 VUs  16.0s/20s

running (17.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
smoke   [  85% ] 5 VUs  17.0s/20s

running (18.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
smoke   [  90% ] 5 VUs  18.0s/20s

running (19.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
smoke   [  95% ] 5 VUs  19.0s/20s

running (20.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
smoke   [ 100% ] 5 VUs  20.0s/20s

running (21.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 5 VUs  20s

running (22.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 5 VUs  20s

running (23.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 5 VUs  20s

running (24.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 5 VUs  20s

running (25.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 5 VUs  20s

     Γ£ô status is 200 (alert-events)
     Γ£ô status is 200 (heatmap)
     Γ£ô status is 200 (trends)
     Γ£ù status is 200 (tenant-summary)
      Γå│  96% ΓÇö Γ£ô 24 / Γ£ù 1
     Γ£ù status is 200 (slo-status)
      Γå│  80% ΓÇö Γ£ô 20 / Γ£ù 5

     checks.........................: 95.19% Γ£ô 119      Γ£ù 6  
     data_received..................: 51 kB  2.0 kB/s
     data_sent......................: 27 kB  1.1 kB/s
   Γ£ô failures.......................: 4.80%  Γ£ô 6        Γ£ù 119
     http_req_blocked...............: avg=709.19┬╡s min=0s    med=0s     max=17.9ms   p(90)=0s       p(95)=444.31┬╡s
     http_req_connecting............: avg=37.66┬╡s  min=0s    med=0s     max=1ms      p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=496.26ms min=548┬╡s med=2.3ms  max=10.24s   p(90)=56.29ms  p(95)=144.2ms 
     Γ£ô { expected_response:true }...: avg=12.45ms  min=548┬╡s med=2.16ms max=145.63ms p(90)=26.18ms  p(95)=56.66ms 
   Γ£ô http_req_failed................: 4.80%  Γ£ô 6        Γ£ù 119
     http_req_receiving.............: avg=131.79┬╡s min=0s    med=0s     max=1.03ms   p(90)=737.52┬╡s p(95)=1ms     
     http_req_sending...............: avg=12.68┬╡s  min=0s    med=0s     max=661.9┬╡s  p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s    med=0s     max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=496.11ms min=548┬╡s med=2.14ms max=10.24s   p(90)=56.29ms  p(95)=143.93ms
     http_reqs......................: 125    4.996195/s
     iteration_duration.............: avg=2.78s    min=1s    med=1.01s  max=11.33s   p(90)=11.28s   p(95)=11.32s  
     iterations.....................: 24     0.959269/s
     vus............................: 5      min=5      max=5
     vus_max........................: 5      min=5      max=5


running (25.0s), 0/5 VUs, 24 complete and 5 interrupted iterations
smoke Γ£ô [ 100% ] 5 VUs  20s