backend/tests/LoadTests/results/analytics-load-20260502-225108.txt

          /\      |ΓÇ╛ΓÇ╛| /ΓÇ╛ΓÇ╛/   /ΓÇ╛ΓÇ╛/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ΓÇ╛ΓÇ╛\  
   /          \   |  |\  \ |  (ΓÇ╛)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: .\analytics-advanced-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 25s max duration (incl. graceful stop):
              * smoke: 5 looping VUs for 20s (exec: smokeSuite, gracefulStop: 5s)


running (01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
smoke   [   5% ] 5 VUs  01.0s/20s

running (02.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
smoke   [  10% ] 5 VUs  02.0s/20s

running (03.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
smoke   [  15% ] 5 VUs  03.0s/20s

running (04.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
smoke   [  20% ] 5 VUs  04.0s/20s

running (05.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  25% ] 5 VUs  05.0s/20s

running (06.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
smoke   [  30% ] 5 VUs  06.0s/20s

running (07.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
smoke   [  35% ] 5 VUs  07.0s/20s

running (08.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
smoke   [  40% ] 5 VUs  08.0s/20s

running (09.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
smoke   [  45% ] 5 VUs  09.0s/20s

running (10.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
smoke   [  50% ] 5 VUs  10.0s/20s

running (11.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
smoke   [  55% ] 5 VUs  11.0s/20s

running (12.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
smoke   [  60% ] 5 VUs  12.0s/20s

running (13.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
smoke   [  65% ] 5 VUs  13.0s/20s

running (14.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
smoke   [  70% ] 5 VUs  14.0s/20s

running (15.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
smoke   [  75% ] 5 VUs  15.0s/20s

running (16.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
smoke   [  80% ] 5 VUs  16.0s/20s

running (17.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
smoke   [  85% ] 5 VUs  17.0s/20s

running (18.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
smoke   [  90% ] 5 VUs  18.0s/20s

running (19.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
smoke   [  95% ] 5 VUs  19.0s/20s

running (20.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
smoke   [ 100% ] 5 VUs  20.0s/20s

running (21.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 5 VUs  20s

running (22.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 5 VUs  20s

running (23.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 5 VUs  20s

running (24.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 5 VUs  20s

running (25.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 5 VUs  20s

     Γ£ù status is 200 (alert-events)
      Γå│  96% ΓÇö Γ£ô 25 / Γ£ù 1
     Γ£ô status is 200 (heatmap)
     Γ£ô status is 200 (trends)
     Γ£ù status is 200 (tenant-summary)
      Γå│  92% ΓÇö Γ£ô 23 / Γ£ù 2
     Γ£ù status is 200 (slo-status)
      Γå│  84% ΓÇö Γ£ô 21 / Γ£ù 4

     checks.........................: 94.44% Γ£ô 119      Γ£ù 7  
     data_received..................: 51 kB  2.0 kB/s
     data_sent......................: 27 kB  1.1 kB/s
   Γ£ù failures.......................: 5.55%  Γ£ô 7        Γ£ù 119
     http_req_blocked...............: avg=929.22┬╡s min=0s    med=0s     max=21.97ms p(90)=0s       p(95)=966.45┬╡s
     http_req_connecting............: avg=221.04┬╡s min=0s    med=0s     max=9.54ms  p(90)=0s       p(95)=588.82┬╡s
     http_req_duration..............: avg=569.48ms min=0s    med=3.23ms max=10.02s  p(90)=84.81ms  p(95)=7.52s   
     Γ£ô { expected_response:true }...: avg=14.16ms  min=0s    med=2.93ms max=133ms   p(90)=27.53ms  p(95)=84.69ms 
   Γ£ù http_req_failed................: 5.55%  Γ£ô 7        Γ£ù 119
     http_req_receiving.............: avg=232.24┬╡s min=0s    med=0s     max=5.17ms  p(90)=795.25┬╡s p(95)=998.12┬╡s
     http_req_sending...............: avg=41.34┬╡s  min=0s    med=0s     max=4.38ms  p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s    med=0s     max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=569.21ms min=0s    med=2.86ms max=10.02s  p(90)=84.81ms  p(95)=7.52s   
     http_reqs......................: 126    5.038376/s
     iteration_duration.............: avg=1.96s    min=1.01s med=1.04s  max=11.05s  p(90)=1.3s     p(95)=10.06s  
     iterations.....................: 23     0.919704/s
     vus............................: 5      min=5      max=5
     vus_max........................: 5      min=5      max=5


running (25.0s), 0/5 VUs, 23 complete and 5 interrupted iterations
smoke Γ£ô [ 100% ] 5 VUs  20s